principles_of_success_msg = ("*🍎 Принципы успеха*\n\n"
                             "Читайте принципы успеха великих " 
                             "людей о том, как сохранять мотивацию и добиваться любых целей. Отправляй" 
                             " мемы себе в избранное ❤️ делись с друзьями и получай поддержку \n\n"
                             "Рубрика постоянно обновляется.\n"
                             "Чтобы получать мемы мотивации раз "
                             "в день сразу послерепорта, нажми 🔔 "
                             "и подпишись на обновления")

tips = []

weekends_msg = ("*Правильно проводите выходные*\n\n"
                  "Чтобы уик-энд запомнился чем-то приятным,"
                  "а не бесконечной работой, которой с головой "
                  "хватает и в будни, научитесь отключаться от всех "
                  "внешних раздражителей. А особенно — от социальных "
                  "сетей. Этим правилом руководствуется сестра Марка "
                  "Цукерберга — Рэнди. Она — исполнительный директор"
                  " Zuckerberg Media. Девушка уверяет, что людям,"
                  " желающим добиться успеха, нужно отказаться от "
                  "ежечасной проверки лент социальных сетей в страхе "
                  "упустить что-нибудь важное. Лучше проводите время "
                  "с пользой, а дела сами найдут вас в понедельник.")
tips.append(weekends_msg)

up_early_msg = ("*Вставайте рано*\n\n"
                "Успешные люди обычно просыпаются рано."
                " Они имеют постоянно продолжающиеся захватывающие вещи,"
                " они не могут дождаться, чтобы сделать их. Поэтому им легко"
                " рано выпрыгнуть с кровати и начать день. Это правило подходит"
                " и для тех, у кого нет веских оснований вставать с постели."
                " Раннее пробуждение даёт вам начало дня и дополнительное время"
                " для подготовки и определения приоритетов. А тишина раннего утра"
                " часто является лучшим временем для того, чтобы все обдумать и "
                "принять правильное решение. Если вы не нашли своё призвание, "
                "раннее утро может быть использовано для его поиска.")
tips.append(up_early_msg)

purposes_msg = ("*Ставьте 3 большие цели на день*\n\n"
                "Вместо того, чтобы  сразу входить в омут с головой и делать"
                " все необходимые задачи, успешные люди составляют план. Определяют,"
                " что наиболее важно для сегодняшнего дня, уделяют приоритетное внимание"
                " этим действиям, и устанавливают три не подлежащих обсуждению цели на весь"
                " день. Это не значит, что у вас не может быть больше трёх целей в день. Но "
                "три больших цели на день — это управляемое число, которое даёт вам чувство"
                " удовлетворения после их завершения. Эти ежедневные цели могут помочь вам "
                "продвинуться вперёд к более крупным целям, определяющим ваше призвание и увлечённость в жизни.")
tips.append(up_early_msg)

training_msg = ("*Упражняйтесь*\n\n"
                "Будь то прогулка, бег или тренировка в спортзале, упражнения — лучший способ начать"
                " свой день с правой ноги. Упражнения обладают обширными физическими преимуществами для "
                "здоровья, также улучшают психологическое здоровье. Когда вы тренируетесь, вы чувствуете "
                "себя более энергичным, позитивным и творческим. Внедряя это правило, вы создадите импульс для"
                " своего дня и будете менее склонны впустую тратить время, сидеть перед телевизором или «лазить»"
                " в интернете. Упражнения не занимают много времени. Даже если это всего лишь прогулка по улице "
                "или прыжки на месте в течение десяти минут.")
tips.append(training_msg)

eliminate_unnecessary_msg = ("*Устраните лишнее и не отвлекайтесь*\n\n"
                             "Прежде чем приступить к какой-либо задаче или действию, удалите все возможные"
                             " отвлечения. Выключите внешние вкладки на своём компьютере. Выключите телефон."
                             " Закройте свою электронную почту. Если вам нужно заглянуть в почту или ответить на звонок,"
                             " установите таймер на дело, которое вы собрались делать. Но когда вы работаете над своими"
                             " целями, делайте все возможное, чтобы поддерживать своё внимание и концентрацию.")
tips.append(eliminate_unnecessary_msg)

reload_yourself_msg = ("*Находите способы перезарядки*\n\n"
                       "Одно из правил успешных людей — совершать перерывы в течение дня, чтобы снова"
                       " зарядиться энергией. Если вы сидите за столом целый день, то вставать и передвигаться "
                       "— абсолютно необходимо. Вы также можете перезаряжаться с помощью короткой медитации, "
                       "вздремнув или просто глубоко вздохнув и потянувшись. Питательные и придающие энергию продукты"
                       " также помогут вам зарядиться. Пейте больше воды в течении дня")
tips.append(reload_yourself_msg)

unite_msg = ("*Объединяйтесь и задавайте вопросы*\n\n"
             "Энтузиазм, энергия и успех, разделяемые людьми, которые живут своими увлечениями, только делают"
             " их опыт богаче и интереснее. Успешные люди привлекают энергию и мотивацию от этих взаимодействий"
             " и намеренно делают их частью своего дня. Если вы ещё не нашли своё увлечение в жизни, объединитесь"
             " с теми, кто это уже сделал. Воспользуйтесь возможностью задавать вопросы и узнавать у них, как "
             "они нашли работу или увлечение, которое они любят, и как они заставляют это увлечение работать на "
             "их жизнь. Люди, проводящие время в изоляции, чаще всего чувствуют себя подавленными, обескураженными "
             "и демотивированными.")
tips.append(unite_msg)

prism_of_positive_msg = ("*Призма позитива*\n\n"
                         "Даже самая интересная работа может иметь сложные, скучные или неприятные элементы."
                         " Одно из правил успешных людей — смотреть на проблему как на очередное препятствие на "
                         "экране радара. Успешные люди могут быстро и уверенно двигаться через них, зная, что их "
                         "ожидают более интересные части их увлечённости. Иногда трудность — это просто средство "
                         "для интересного и успешного конца. Если вы не нашли свою увлечённость и призвание в жизни,"
                         " то попытка найти его может показаться огромной проблемой. Но поиск вашей увлечённости "
                         "приведёт вас к чему-то прекрасному.")
tips.append(unite_msg)

actions_result_msg = ("*Действия, а не результат*\n\n"
                      "Люди успешны, потому что им нравится заниматься тем, что их увлекает и видеть преследование"
                      " цели как награду. Если вы все ещё ищете своё призвание, попробуйте воспринять поиск своей "
                      "увлечённости как приключение. Каждая задача или действие, которое вы предпринимаете для её "
                      "поиска, может быть интересным и просветительским. Вы никогда не знаете, что можете узнать "
                      "нового о себе на пути к своей увлечённости, поэтому не стоит так ориентироваться на результате,"
                      " чтобы не пропустить ценную информацию на этом пути.")
tips.append(actions_result_msg)

about_results_msg = ("*Не ожидайте великих результатов*\n\n"
                     "Важное правило успешных людей — иметь ежедневное ожидание, что хорошее происходит и будет"
                     " продолжаться. Когда вы делаете все возможное, когда вы очень сосредоточены и вдохновлены, "
                     "вы действительно делаете великие и отличные вещи. Успешные люди не создают в своём воображении"
                     " ужасное будущее и не беспокоятся о том, «что, если». Они имеют уверенность в себе, поддерживая"
                     " свою веру в то, что все будет хорошо, поэтому они полны решимости делать то, что нужно. Неудачи"
                     " это камешки на пути, а не глыбы, блокирующие путь. Они учатся на своём опыте и используют эти "
                     "знания, чтобы двигаться вперёд.")
tips.append(about_results_msg)

end_of_day_msg = ("*Заканчивайте день с благодарностью*\n\n"
                  "Мы все имеем тенденцию сосредотачиваться больше на отрицательном, чем на положительном, но "
                  "помните, что у вас есть возможность контролировать свои мысли. Прежде чем отправить сообщение своему"
                  " подсознанию о том, что жизнь плохая, создайте новый диалог в своей голове перед сном. Возьмите ручку"
                  " и бумагу и запишите все положительные вещи, которые произошли во время сегодняшнего дня. Возьмите "
                  "за правило записывать всех людей и обстоятельства в своей жизни, за которые вы выражаете "
                  "благодарность. Если вам сложно придумать это, подумайте о том, какова была бы ваша жизнь без "
                  "определённых людей и вещей…")
tips.append(end_of_day_msg)

