principles_fm_success_msg = """*🎪 Мировые шедевры литературы и кинематографа.*\n\n
В вашем распоряжении тысячи трейлеров и тизеров книг об удивительных историях самых разных людей о том,
 как они идут свой путь к заветным мечтам и добиваются амбицизных целей."""

tips = []

tips.append("""*🎥 «Человек, который изменил всё»*\n\n
В 2012 году удостоился целых шести номинаций на премию «Оскар», среди которых была и главная - «За лучший фильм года».
 Это неординарная и увлекательная спортивная драма с Брэдом Питтом, основанная на реальных событиях, о решительном
  и смелом руководителе бейсбольной команды, поставившем всё на новую и, казалось бы,…""")

tips.append("""*🎥 «Одержимость»*\n\n
Стать звездой джаза даже сложнее, чем покорять вершины большого спорта. Постоянные тренировки, кровавые мозоли
 и полное самоотречение — таков путь ударника Эндрю. Герой фильма равняется только на великих и в бешеном ритме идёт
  к победе. Непонимание в семье, пренебрежение коллег и зависть конкурентов ещё не всё…""")

tips.append("""*🎥 «Скрытые фигуры»*\n\n
Америка начала 1960-х. На на земле все ещё царит вековое неравенство. Да, афроамериканки уже работают в НАСА вместе 
с белыми мужчинами в галстуках, но остаются для большинства невидимыми, как привидения. Героини фильма — три женщины
-математика — выполняют работу, от которой зависит космическая программа США…""")

tips.append("""*🎥 «Каждое воскресенье»*\n\n
Молодой спортсмен Вилли, играющий в американский футбол, становится звездой «Акул Майями» и проходит с командой 
через огонь, воду и медные трубы. И тут не только тяготы тренировок, но и звёздная болезнь, отягощённая комплексами
 «чёрного превосходства», которая может погубить и карьеру Вилли, и общее дело. Преодолевать своё тщеславие…""")

tips.append("""*🎥 «Не волнуйся, он далеко не уйдёт»*\n\n
Герой Хоакина Феникса — свободный художник в оковах паралича. После автомобильной аварии (не садись в машину
 с пьяным за рулём!) он уже не весёлый тусовщик, а стареющий алкоголик в инвалидной коляске. Но, оказывается, самые
  мрачные обстоятельства могут подтолкнуть человека, не сломленного духом, не только к возрождению, но и к славе…""")

tips.append("""*🎥 «В погоне за счастьем»*\n\n
От начинающего бизнесмена до бездомного — путь на социальное дно часто короче, чем кажется. Новые приборы для 
рентгенологов не покупаются, зато растут штрафы за неправильную парковку. Платить за квартиру скоро оказывается нечем,
 и в конце концов жена неудачливого торговца медицинским оборудованием едет на заработки…""")

tips.append("""*🎥 «Далласский клуб покупателей»*\n\n
История борьбы реального американца Рона Вудруфа со смертью и за здравый смысл против косной бюрократической системы
 и охвативших общество предрассудков. Рон, простой ковбой из Техаса, узнает, что у него СПИД. Такая новость — настоящий
  личный апокалипсис, но герой Мэттью МакКонахи, вопреки всему, не намерен умирать…""")

tips.append("""*🎥 «Побег из Шоушенка»*\n\n
Говорят, пока человек жив, он может все поменять. Несправедливо осуждённый банкир Энди Дюфрейн — тихий интеллектуал
 ведёт чёрную бухгалтерию тюремного начальства, и 20 лет готовит побег. А как он осуществляет свой план — это 
 лучше один раз увидеть. Фильм Фрэнка Дарабонта — бессменный лидер зрительских рейтингов…""")

tips.append("""*🎥 «Я — Сэм»*\n\n
Шон Пенн в роли парня с задержкой в развитии, который нечаянно стал отцом-одиночкой. Очаровательная дочь Люси 
(папа — фанат «Битлз») очень быстро перегоняет отца в интеллектуальном смысле, но это не нарушает идиллии их любви,
 тем более что вокруг друзья и знакомые, готовые помочь. И все было бы хорошо, если бы не…""")

tips.append("""*🎥 «Спасительный рассвет»*\n\n
Глядя на самолёты союзников над его родным Вилдебергом, немецкий мальчик Дитер Денглер захотел летать.
 Он вырос, уехал в США и стал пилотом ВВС. Полет Дитера прервался во Вьетнаме: сбитый вьетконговцами, он 
 попал в плен. Но не сдался, а разработал план побега и вскоре оказался в незнакомых джунглях без воды, еды 
 и оружия…""")