from aiogram import types

deposit_msg = ("*Выбери комфортную сумму*\n\n"
               "Твой депозит будет заморожен"
               "в Диспуте до момента победы в споре "
               "и будет доступен для мгновенного вывода"
               " в любое время или начала следующей игры")

other_sum_msg = ("Введи комфортную сумму в рублях (только цифра, без копеек)."
                 " Депозит не может быть меньше 15000 ₽ и не больше 150000 ₽")

application_for_payment_msg = ("*Ваша заявка #TG3042 создана*\n"
                               "Вам выделяется на оплату 30 минут с момента получения реквизитов.\n"
                               " Обработка заявок круглосуточная.\n\n"
                               "По истечению времени, заявка снимается с оплаты. "
                               "Вы можете открыть новый Диспут и создать новую заявку.\n\n"
                               "После оплаты ожидайте автоматического подтверждения платежа и сообщение о том, "
                               "что ваша заявка оплачена.\n\n"
                               "В случае, если через 15 минут вы не получили подтверждения, "
                               "свяжитесь с нами по кнопке «Проблема с оплатой».")

