books = []

books.append("""*📗 «Твёрдость характера. Сила страсти и настойчивости», Анджела Дакворт*\n\n
Книга рассказывает о том, что люди добиваются успеха благодаря не своему таланту, а страстной настойчивости.
 При этом автор предлагает отказаться от привычного стереотипа, что успех — это тяжёлая работа…""")

books.append("""*📗 «Безумно богатые азиаты», Кевин Кван*\n\n
Жительница Нью-Йорка Рейчел Чу планирует провести всё лето в Сингапуре вместе со своим бойфрендом Ником Янгом.
 Но Ник не рассказал Рейчел о том, что его семья сказочно богата, а он — самый завидный жених в стране.
  Отдых, который планировался как тихое семейное время, оборачивается…""")

books.append("""*📗 «От нуля к единице», Питер Тиль, Блейк Мастерс*\n\n
Книга о том, как создать компанию с нуля и сделать её лидером рынка. Её автором является Питер Тиль, который создал
 платёжную систему PayPal и был первым инвестором Facebook…""")

books.append("""*📗 «Иди туда, где трудно. 7 шагов для обретения внутренней силы», Таэ Юн Ким*\n\n
Ким уверена: каждый из нас — не важно, мужчина или женщина, американец, русский или кореец — способен
 достичь абсолютно любой цели. Единственное, что нам мешает, – это внутренние установки: страхи, неверие в 
 свои силы, зависимость от чужого мнения, неспособность…""")