dispute_choice_msg = ("*Спорим что вы добьётесь любой своей цели?*\n\n"
                      "🚫 Брошу курить / пить / наркотики\n"
                      "🌱 Займусь спортом / похудею\n"
                      "🌤 Буду вставать рано утром\n"
                      "🥐 Позавтракаю в Париже\n"
                      "🇬🇧 Выучу иностранный язык\n"
                      "💰 Накоплю сумму денег\n"
                      "📍 Покорю Эверест\n"
                      "⭐️ Стану популярным\n"
                      "🍩 Открою пекарню\n"
                      "🏅 Закрою кредиты / долги\n"
                      "✏️ Напишу свою книгу и многое др.\n\n"
                      "Выбери своё первое испытание, заключи пари 🤝и проверь, на что ты действительно способен/а")

personal_goals_msg = ("📍 Покорю Эверест\n"
                      "⭐️ Стану популярным\n"
                      "✏️ Напишу свою книгу\n"
                      "💸 Заработаю миллион\n"
                      "🍩 Открою пекарню\n"
                      "🏅 Закрою кредиты / долги\n"
                      "🥐 Позавтракаю в Париже… \n\n"
                      "и любые другие ваши самые смелые мечты и эксперименты...")

quit_alcohol_msg = ('*Например:*\n'
                    '🍷 Брошу пить алкоголь\n\n'
                    '*Условия на 30 дней*\n'
                    '🤳 Видео с кодом и отрицательным алкотестом\n'
                    '⌛ Отправлять в бот до 22:30\n\n'
                    '*Доказательства*\n'
                    ' ‧  Валидация кода\n'
                    ' ‧  Время отправки')

quit_smoking_msg = ('*Например:*\n'
                    '🚬 Брошу курить никотин\n\n'
                    '*Условия на 30 дней*\n'
                    '🤳 Видео с кодом и экспресс-тестом\n'
                    '⌛ Отправлять в бот до 22:30\n\n'
                    '*Доказательства*\n'
                    ' ‧  Валидация кода\n'
                    ' ‧  Время отправки')

quit_drugs_msg = ('*Например:*\n'
                  '💊 Брошу употреблять ПАВ\n\n'
                  '*Условия на 30 дней*\n'
                  '🤳 Видео с кодом и экспресс-тестом на ПАВ\n'
                  '⌛ Отправлять в бот до 22:30\n\n'
                  '*Доказательства*\n'
                  ' ‧  Валидация кода\n'
                  ' ‧  Время отправки')

go_to_gym_msg = ('*Например:*\n'
                 '💪 Буду ходить в спорт-зал\n\n'
                 '*Условия на 30 дней*\n'
                 '🤳 Видео с кодом в зеркале спорт-зала\n'
                 '⌛ Отправлять в бот до 22:30\n\n'
                 '*Доказательства*\n'
                 ' ‧  Валидация кода\n'
                 ' ‧  Время отправки')
lose_weight_msg = ('*Например:*\n'
                   '🌱 Похудею на 5 кг\n\n'
                   '*Условия на 30 дней*\n'
                   '🤳 Видео взвешивания с кодом\n'
                   '⌛ Отправлять в бот до 22:30\n\n'
                   '*Доказательства*\n'
                   ' ‧  Валидация кода\n'
                   ' ‧  Время отправки')

early_morning_msg = ('*Например:*\n'
                     '🌤 Буду вставать в 6 утра\n\n'
                     '*Условия на 30 дней*\n'
                     '🤳 Видео с кодом в зеркале ванны\n'
                     '⌛ Отправлять в бот до 6:30\n\n'
                     '*Доказательства*\n'
                     ' ‧  Валидация кода\n'
                     ' ‧  Время отправки')

teach_other_language_msg = ('*Например:*\n'
                            '🇬🇧 Буду учить английский язык\n\n'
                            '*Условия на 30 дней*\n'
                            '🤳 Видео с кодом и конспектами\n'
                            '⌛ Отправлять в бот до 22:30\n\n'
                            '*Доказательства*\n'
                            ' ‧  Валидация кода\n'
                            ' ‧  Время отправки')

more_money_msg = ('*Например:*\n'
                  '💰Накоплю 100 000 ₽\n\n'
                  '*Условия на 30 дней*\n'
                  '🤳 Запись экрана из банка с кодом\n'
                  '⌛ Отправлять в бот до 22:30\n\n'
                  '*Доказательства*\n'
                  ' ‧  Валидация кода\n'
                  ' ‧  Время отправки')

cook_helthy_food_msg = ('*Например:*\n'
                        '🍏 Научусь готовить здоровую еду\n\n'
                        '*Условия на 30 дней*\n'
                        '🤳 Видео с кодом и процессом\n'
                        '⌛ Отправлять в бот до 22:30\n\n'
                        '*Доказательства*\n'
                        ' ‧  Валидация кода\n'
                        ' ‧  Время отправки')

learn_programming_msg = ('*Например:*\n'
                         '💻 Научусь программировать\n\n'
                         '*Условия на 30 дней*\n'
                         '🤳 Видео с кодом и процессом\n'
                         '⌛ Отправлять в бот до 22:30\n\n'
                         '*Доказательства*\n'
                         ' ‧  Валидация кода\n'
                         ' ‧  Время отправки')

play_instruments_msg = ('*Например:*\n'
                        '🎼 Научусь играть на\n\n'
                        '*Условия на 30 дней*\n'
                        '🤳 Видео с кодом и процессом\n'
                        '⌛ Отправлять в бот до 22:30\n\n'
                        '*Доказательства*\n'
                        ' ‧  Валидация кода\n'
                        ' ‧  Время отправки')

learn_painting_msg = ('*Например:*\n'
                      '🎨 Научусь рисовать\n\n'
                      '*Условия на 30 дней*\n'
                      '🤳 Видео с кодом и процессом\n'
                      '⌛ Отправлять в бот до 22:30\n\n'
                      '*Доказательства*\n'
                      ' ‧  Валидация кода\n'
                      ' ‧  Время отправки')
