tips = []

start_msg = ("""*Не сдавайся*\n\n
Читай ободряющие советы и смотрите легендарные лекции с международной конференции TED о продуктивности, прокрастинации, внутренней мотивации, успехах и поражениях""")

tips.append(""" *☝️ Неудача не окончательна.*\n\n
Независимо от ваших обстоятельств, вы время от времени терпите неудачу. Это нормально. Единственный способ по-настоящему потерпеть неудачу — отказаться от своих целей. Препятствия, с которыми вы сталкиваетесь на пути к успеху, — это просто строительные блоки для жизни, которой вы хотите.
Путь к цели похож на подъем по лестнице и подразумевает постепенное движение вверх. Даже если это всего лишь детские и небольшие шаги, продолжай постоянно двигаться к тому, к чему ты стремишься.""")

tips.append(""" *☝️ Сосредоточьтесь на том, что вы можете контролировать.*\n\n
Как бы вы ни старались, в жизни есть вещи, которые вы не можете изменить. Вы должны научиться сосредотачиваться на том, что вы можете контролировать. Это легче сказать, чем сделать, но это реальность, которую вы должны принять. 
Человек может многое, но, увы, не все. Нам не под силу вернуть к жизни умерших, заставить полюбить себя того, кто к нам безразличен, изменить прошлое или законы физики. Однако список того, что нам под силу — впечатляет.
Некоторые цели могут быть более труднодостижимы, чем другие, но, тщательно о них подумав, ты поймешь, что при большом желании, терпении и прикладывании усилий ты сможешь их достичь.""")

tips.append("""*☝️ Собери себя и откалибруй*\n\n
Проблемы редко бывают такими серьезными, как вы думаете. Как только вы поймете, что все не так плохо, как вы думали, будьте готовы изменить ситуацию и вернуться на правильный путь. Когда вы спокойны и собраны, легче принимать решения.
Когда у нас ничего не получается и в жизни масса проблем, мы склонны думать, что дальше будет только хуже. Никто не может дать гарантий, что худшее не случится, но абсолютно бессмысленно постоянно думать о катастрофичном развитии событий и пугать себя этими картинками. Вместо этого переключись на мысли о более приятном исходе событий и улучшении ситуации в ближайшем будущем.""")

tips.append("""*☝️ Измените свою точку зрения*\n\n
Счастье — это вопрос перспективы. Когда вы рассматриваете свою борьбу как поражение, ваши мысли и чувства будут негативными. Активно извлекая уроки из своей боли, вы улучшаете свои мысли и эмоции.\n\n\n\n
Когда ты думаешь о том, «почему у меня ничего не получается», спроси себя, а что собственно должно получиться. Если в твоем представлении счастье наступит только когда у тебя появится особняк в Монако и приватный самолет, есть большой риск, что ты обрекаешь себя на вечное пребывание в состоянии несчастья, ведь добиться желаемого объективно не так-то просто.""")

tips.append(""" *☝️ Будь благодарным*\n\n
Благодарность помогает нам оставаться сосредоточенными в трудные времена. Это позволяет нам смотреть на жизнь во всей ее полноте, а не поддаваться влиянию временных обстоятельств. Всегда признавайте и цените даже свои самые маленькие победы. Благодарность будет направлять вас.""")

tips.append("""*☝️ Не будь жертвой*\n\n
В конце концов, мы превращаем себя в жертву, успокаиваясь и сдаваясь. Боль может остановить вас или придать вам силы. Вы можете быть жертвой, а можете изучать жизненные уроки. Выбор за вами.""")

tips.append("""*☝️ Ты не одинок/а*\n\n
Не позволяйте своей боли изолировать себя. Есть люди, которые все еще верят в вас. Положитесь на них и позвольте им поддержать вас. Гордость всегда усиливает боль неудачи. Будьте скромны и принимайте поддержку.\n\n
Проводи время с людьми, которые тебя поддерживают. Поверь, это прекрасный способ получить подзарядку, необходимую для того, чтобы выйти из порочного круга и начать менять свою жизнь к лучшему. Только постарайся не превратиться в энергетического вампира, не ной и не злоупотребляй добрым отношением других людей. И не забывай проявлять в ответ внимание и заботу к ним.""")

tips.append("""*☝️ Остановись и задумайся*\n\n
Чтобы выйти из колеи, нужны целенаправленные усилия. Вы должны остановиться и подумать о своих недостатках. Эти размышления выведут вас из реактивного состояния и помогут принимать рациональные решения. Это экспоненциально ускорит ваше выздоровление.\n\n
Сложные ситуации часто могут научить нас тому, что нам еще предстоит узнать. Оказавшись в точке, где все идет плохо, подумай, почему так произошло и что ты можешь сделать, чтобы изменить это.""")