teds = []

teds.append(["Чтобы преодолеть проблемы, перестань сравнивать себя с другими - Дин Фёрнесс 720p",
                 "https://t.me/tedarchive/580"])
teds.append(["Для родителей счастье — это трудная цель - Дженнифер Сениор 720p", "https://t.me/tedarchive/574"])
teds.append(["Четыре признака эмоционального насилия — Вианн Нгуен-Фенг 720p", "https://t.me/tedarchive/570"])
teds.append(["Как купить счастье - Майкл Нортон 720p", "https://t.me/tedarchive/566"])
teds.append(["Помогая другим, мы становимся счастливее, но важно, как именно это делать - Элизабет Данн 720p", "https://t.me/tedarchive/568"])
