start_FAQ = "*🧠 FAQ*\n\nПолучи ответы на самые важные и популярные вопросы о Диспуте"

quests = []

quests.append("🧠 * Об игре.*\n\n"
              "Диспут Бот – новая коуч-игра в Телеграм, где люди за 30 дней добиваются личных целей, заветных мечт, "
              "увеличивают продуктивность, и шаг-за-шагом вырабатывают новые полезные привычки для счастливой, продолжительной "
              "и благополучной жизни.\n\n"
              "Игрок выбирает себе цель и вносит депозит, проходит подготовку, после чего начинает свой “Путь Героя”. "
              "В доказательство процесса и результата, игрок ежедневно присылает в бот короткое видео, где произносит "
              "код, который автоматически генерируется и приходит в бот рано утром. При соблюдении условий Диспута, "
              "игрок сохраняет депозит, чтобы вывести его из игры в случае победы или выбрать следующую цель и "
              "продолжить игру. Если условия Диспута нарушаются, игрок теряет сначала 20% депозита, а при повторной "
              "ошибке проигрывает остальные 80%. Если у игрока есть промо-код, то у него появляется возможность совершить "
              "одну ошибку без потери депозита.\n\n"
              "В игре люди бросают курить, пить и употреблять вещества, встают рано утром, много успевают, "
              "развиваются, учат новые языки, играют на фортепьяно, питаются здоровой едой, учатся новым профессиям, "
              "открывают бизнес, покоряют Эверест, копят деньги, путешествуют, пишут книги, худеют и регулярно "
              "занимаются спортом.  Яркий вызов самому себе меняет жизнь игроков в лучшую сторону, даже если получается "
              "не с первого раза. Проиграть свои деньги или сохранить их – ежедневный выбор каждого, а не случайность и "
              "обстоятельства, поэтому тем, кто преодолевает себя и выигрывает первый Диспут, прохождение последующих "
              "игр с персональными целями возможно без внесения дополнительного депозита. Также, в игре предусмотрены "
              "специальные механики, позволяющие в несколько раз увеличить изначальный депозит и заработать.\n\n"
              "Для того, чтобы сохранять мотивацию и фокус на одной цели, превращая процесс в полезную "
              "привычку, на протяжении игры каждому игроку доступна обширная база знаний: правила жизни великих людей, "
              "медиатека книг и фильмов об историях успеха, выступления и легендарные лекции известных спикеров с TED, "
              "а так же, уникальная функция “Дневник”, которая помогает разобраться в мыслях и честно ответить себе на "
              "важные жизненные вопросы, чтобы изменения происходили как физически, так и ментально, а приобретение "
              "полезных привычек и путешествие к цели было комфортным, увлекательным и поистине трансформирующим.\n\n"
              "Каждый квартал Диспут перечисляет часть прибыли в Благотворительный Фонд помощи хосписам «Вера».")

quests.append("*🧠 Почему это работает?*\n\n"
              "Разбивая каждую цель на этапы, можно определить точки, в которых будет возможно доказать свой путь и отследить прогресс."
              " Для этого мы разработали уникальную систему репортов.\n\n"
              "– Чёткие условия и правила игры, прозрачная ответственность\n\n"
              "– Мотивация не потерять свои деньги работает так же сильно, как мотивация заработать\n\n"
              "– Интерактивный контент, чтобы сохранять мотивацию и фокус на одной цели, превращая процесс в полезную привычку, "
              "действительно меняющую вас и вашу жизнь.")

quests.append("*🧠 Подготовка к диспуту обязательна?*\n\n"
              "Да, так вы легче всего научитесь правилам и получите опыт реальной игры в тестовом формате без потери депозита "
              "в случае неудачи.\n\n"
              "Для некоторых целей понадобится выполнить самостоятельную подготовку, иначе вы просто не сможете выполнить условия, "
              "придти к цели и сохранить депозит.\n\n"
              "Например, если цель бросить пить, то потребуется заранее приобрести в аптеке экспресс-тесты (30 шт на 30 дней спора)"
              " на алкоголь и брать с собой при поездках из дома более, чем на день. Если цель в том, чтобы ходить в зал,"
              " позаботьтесь о том, чтобы заранее иметь абонемент с доступом в зал в выходные и праздничные дни. Ответственность за"
              " это только на вас. Если вы придёте в спорт-зал и он окажется закрыт, твоя задача попасть в другой зал, который "
              "работает и выполнить условия своего 30 дневного Диспута, без праздников и выходных.\n\n"
              "Бот присылает напоминание о необходимости пройти подготовку ежедневно на протяжении 3х дней. Если через 5 дней после "
              "начала вы не завершите подготовку — ваш Диспут будет считаться проигранным.")

quests.append("*🧠 Про пополнение и вывод депозита.*\n\n"
              "Пополнение депозита возможно 24/7 в BTC или банковской картой с помощью сервиса он-лайн обмена.\n\n"
              "Выдаются реквизиты карты на которую необходимо совершить перевод в течении 30 минут. По истечению времени, заявка "
              "снимается с оплаты. Вы можете открыть новый Диспут и создать новую заявку. После перевода необходимо дождаться "
              "автоматического уведомления об успешном пополнении вашего счёта. Если вы не получили уведомление в течении 15 минут,"
              " необходимо связаться с нашей службой поддержки, предоставив чек перевода.\n\n"
              "Вывод средств доступен после победы в Диспуте также в BTC или переводом средств на вашу банковскую карту в течении "
              "суток с момента создания заявки.\n\n"
              "Бот не берет с игроков комиссию ни за пополнение депозита, ни за вывод средств в случае победы.")

quests.append("*🧠 В какой день начинается диспут, если я выбираю вариант начала «В понедельник»?*\n\n"
              "Начать игру можно либо послезавтра, либо с понедельника. Мы предусматриваем как минимум один день на подготовку и,"
              " например, покупку необходимого для спора инвентаря. Рассчитайте своё время старта самостоятельно, с учётом необходимой подготовки.\n\n"
              "«В понедельник» - это всегда следующий понедельник. Если диспут был открыт в воскресенье или в  понедельник, "
              "то код придёт в следующий понедельник. Если был открыт в субботу, то в этот понедельник, то есть всегда "
              "не раньше, чем послезавтра.")

quests.append("*🧠 Гарантии. Безопасность. Цензура*\n\n"
              "Актуальный депозит пользователя заморожен только на момент Диспута и хранится в 🟢 Аккаунте во вкладке 💰 Депозит.\n"
              "Отзывы публикуются анонимно, без ссылок на ваш личный аккаунт.\n\n"
              "Вы можете снимать себя без лица или прикрывая лицо, если заботитесь о своей анонимности. Мы, в свою очередь, "
              "заботимся о вашей анонимности, даже если в ваш кадр попадает лицо, мы не распространяем личные данные из игры и вы "
              "никогда не найдете их за пределами бота. Исключение составляет внутренний конкурс “DisputeAward” - там игроки "
              "сами отправляют свои видео на конкурс и отдельно дают своё разрешение на публикацию победившего видео внутри бота.\n\n"
              "Бот оставляет за собой право блокировать аккаунты игроков, которые снимают себя в непристойном виде или позволяют себе "
              "нецензурно выражаться в адрес Диспута.")

quests.append("*🧠 Я путешествую в другой город/страну. Там другое время.*\n\n"
              "Для этого понадобится изменить часовой пояс в боте.\n\nПерейди в раздел \"🟢 Аккаунт\" и выбери раздел \"🌍 Часовой пояс\", нажмите \"Отправить Гео📍\" или выберите нужный часовой пояс самостоятельно.\n\n"

              "Изменить свой часовой пояс возможно не более 2х раз за неделю.")

quests.append("*🧠 Почему многие люди побеждают?*\n\n"
              "Проиграть свои деньги или сохранить их – ежедневный выбор каждого игрока. Все мы сталкиваемся с ленью или"
              "обстоятельствами уникальной, сложной и непредсказуемой жизни, но мотивация не проиграть депозит работает так же,"
              "как желание заработать. Побеждать самого себя 30 дней или проиграть спор – решать только тебе.")
